###################################################################

# Created by write_sdc on Sun Feb 21 20:04:24 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[31]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[30]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[29]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[28]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[27]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[26]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[25]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[24]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[23]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[22]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[21]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[20]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[19]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[18]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[17]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[16]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[15]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[14]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[13]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[12]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[11]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[10]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[9]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[8]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[7]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[6]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[5]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[4]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[3]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[2]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[1]}]
set_load -pin_load 3.40189 [get_ports {INS_ADDR_out[0]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[31]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[30]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[29]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[28]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[27]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[26]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[25]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[24]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[23]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[22]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[21]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[20]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[19]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[18]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[17]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[16]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[15]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[14]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[13]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[12]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[11]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[10]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[9]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[8]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[7]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[6]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[5]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[4]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[3]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[2]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[1]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDR_out[0]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[31]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[30]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[29]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[28]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[27]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[26]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[25]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[24]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[23]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[22]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[21]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[20]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[19]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[18]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[17]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[16]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[15]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[14]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[13]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[12]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[11]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[10]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[9]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[8]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[7]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[6]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[5]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[4]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[3]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[2]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[1]}]
set_load -pin_load 3.40189 [get_ports {DATA_out[0]}]
set_load -pin_load 3.40189 [get_ports MemWrite]
set_load -pin_load 3.40189 [get_ports MemRead]
create_clock [get_ports CLK]  -name MY_CLK  -period 0  -waveform {0 0}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RST]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INS_in[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_in[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {INS_ADDR_out[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDR_out[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_out[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MemWrite]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MemRead]
